Revit 2026 API

# StructuralReleaseType Enumeration

---

Type of structural release, which is used for the BuiltIn parameter STRUCTURAL_END_RELEASE_TYPE.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StructuralReleaseType
```
```vb
Public Enumeration StructuralReleaseType
```
```cpp
public enum class StructuralReleaseType
```
```fsharp
type StructuralReleaseType
```

| Member name | Value | Description |
| --- | --- | --- |
| kBendingMoment | 2 |  |
| kFixed | 0 |  |
| kPinned | 1 |  |
| kUserDefined | 3 |  |

#### Reference

Autodesk.Revit.DB Namespace